from ..core.managers import edit_or_reply
from . import zedub



# t.me/senzir1
ZelzalDV_cmd_1111 = (
    "𓆩 [𝗦𝗼𝘂𝗿𝗰𝗲 𝐑𝐄𝐅𝐙 - اوامر الزخرفه ](t.me/def_Zoka) 𓆪\n\n"
    " ⏎ اهلا بك في اوامر الزخرفه\n"
    " ⏎لاستعمال الامر ⏎ 𐇮.زخرفه + اسم الي تريدو\n"
    " تريدو لزخرفته ملحوظه عليك الاشتراك بقنوات التي ستظهر امامك \n"
    "\n𓆩 [𐇮 𝙎𓏺𝞝𝙉𝙕𝙄𝙍 الهہـيـٖ͡ـ͢ـبـه 𐇮](t.me/senzir1) 𓆪"
    "\n𓆩 [𐇮 ⧛𝐙𝐎𝐊𝐀 الهہـيـٖ͡ـ͢ـبـه 𐇮](t.me/Q_2_Q_Y) 𓆪"
)

@zedub.zed_cmd(pattern="م29")
async def cmd_29(event):
    await edit_or_reply(event, ZelzalDV_cmd_1111)
    
# t.me/senzir1
ZelzalDV_cmd = (
    "𓆩 [𝗦𝗼𝘂𝗿𝗰𝗲 𝐑𝐄𝐅𝐙 - التحديثات الجديدة ](t.me/def_Zoka) 𓆪\n\n"
    "⪼تم اضافه امر .بعصه\n"
    "⪼تم اضافه امر .شطان\n"
    "⪼تم اضافه امر .انطق\n"
    "⪼سيتم اضافه الاوامر الاخرى قريبا\n"
    "\n𓆩 [𐇮 𝙎𓏺𝞝𝙉𝙕𝙄𝙍 الهہـيـٖ͡ـ͢ـبـه 𐇮](t.me/senzir1) 𓆪"
)

@zedub.zed_cmd(pattern="م30")
async def cmd_30(event):
    await edit_or_reply(event, ZelzalDV_cmd)


# t.me/senzir1
ZelzalDV_cmd_2 = (
    "𓆩 [𝗦𝗼𝘂𝗿𝗰𝗲 𝐑𝐄𝐅𝐙 - اوامر الانتحال ](t.me/def_Zoka) 𓆪\n\n"
    "⪼ .انتحال\n"
    "⪼لاعاده حسابك كمان كان ارسل  .اعاده\n"
    "\n𓆩 [𐇮 𝙎𓏺𝞝𝙉𝙕𝙄𝙍 الهہـيـٖ͡ـ͢ـبـه 𐇮](t.me/senzir1) 𓆪"
)

@zedub.zed_cmd(pattern="م31")
async def cmd_31(event):
    await edit_or_reply(event, ZelzalDV_cmd_2)



# t.me/senzir1
ZelzalDV_cmd_3 = (
    "𓆩 [𝗦𝗼𝘂𝗿𝗰𝗲 𝐑𝐄𝐅𝐙 - اوامر التقليد ](t.me/def_Zoka) 𓆪\n\n"
    "⪼  .ازعاج\n"
    "⪼ .الغاء ازعاج\n"
    "⪼ .تقليد\n"
    "⪼ .الغاء تقليد \n"
    "⪼  .المقلدهم \n"
    "⪼  .حذف فار المقلدهم \n"
    "\n𓆩 [𐇮 𝙎𓏺𝞝𝙉𝙕𝙄𝙍 الهہـيـٖ͡ـ͢ـبـه 𐇮](t.me/senzir1) 𓆪"
)

@zedub.zed_cmd(pattern="م32")
async def cmd_32(event):
    await edit_or_reply(event, ZelzalDV_cmd_3)


# t.me/senzir1
ZelzalDV_cmd_4 = (
    "𓆩 [𝗦𝗼𝘂𝗿𝗰𝗲 𝐑𝐄𝐅𝐙 - اوامر الالعاب المتطوره ](t.me/def_Zoka) 𓆪\n\n"
    "⪼ قم بارسال .بلاي \n"
    "⪼برعاية المطور سينزر  \n" 
    "⪼ ⪼ برعاية المطور زوكا \n"
    "\n𓆩 [𐇮 𝙎𓏺𝞝𝙉𝙕𝙄𝙍 الهہـيـٖ͡ـ͢ـبـه 𐇮](t.me/senzir1) 𓆪"
)

@zedub.zed_cmd(pattern="م33")
async def cmd_33(event):
    await edit_or_reply(event, ZelzalDV_cmd_4)


# t.me/senzir1
ZelzalDV_cmd_5 = (
    "𓆩 [𝗦𝗼𝘂𝗿𝗰𝗲 𝐑𝐄𝐅𝐙 - اوامر بوت استخراج الجلسات](t.me/def_Zoka) 𓆪\n\n"
    "⪼ بوت استخراج جلسات الخاص بسورس ريفز \n"
    "⪼(@rev_m_1bot)n"
    "⪼برعاية المطور سينزر  \n" 
    "⪼ ⪼ برعاية المطور زوكا \n"
    "\n𓆩 [𐇮 𝙎𓏺𝞝𝙉𝙕𝙄𝙍 الهہـيـٖ͡ـ͢ـبـه 𐇮](t.me/senzir1) 𓆪"
)

@zedub.zed_cmd(pattern="م34")
async def cmd_34(event):
    await edit_or_reply(event, ZelzalDV_cmd_5)


# t.me/senzir1
ZelzalDV_cmd_6 = (
    "𓆩 [𝗦𝗼𝘂𝗿𝗰𝗲 𝐑𝐄𝐅𝐙 - اوامر التبليغ لتطير القنوات ](t.me/def_Zoka) 𓆪\n\n"
    " ⏎ اهلا بك في اوامر البلاغات\n"
    " ⏎لاستعمال الامر ⏎ 𐇮.بلاغ+ عدد البلاغات+ بلرد ع كود\n"
    "\n𓆩 [𐇮 𝙎𓏺𝞝𝙉𝙕𝙄𝙍 الهہـيـٖ͡ـ͢ـبـه 𐇮](t.me/senzir1) 𓆪"
    "\n𓆩 [𐇮 ⧛𝐙𝐎𝐊𝐀 الهہـيـٖ͡ـ͢ـبـه 𐇮](t.me/Q_2_Q_Y) 𓆪"
)

@zedub.zed_cmd(pattern="م35")
async def cmd_35(event):
    await edit_or_reply(event, ZelzalDV_cmd_6)

# t.me/senzir1
ZelzalDV_cmd_7 = (
    "𓆩 [𝗦𝗼𝘂𝗿𝗰𝗲 𝐑𝐄𝐅𝐙 - اوامر تحميل مسلسلات ولافلام](t.me/def_Zoka) 𓆪\n\n"
    "↫.يوت + اسم المسلسل او الفيلم او الي انت عايزو\n"
    
    "\n𓆩 [𐇮 𝙎𓏺𝞝𝙉𝙕𝙄𝙍 الهہـيـٖ͡ـ͢ـبـه 𐇮](t.me/senzir1) 𓆪"
)

@zedub.zed_cmd(pattern="م36")
async def cmd_36(event):
    await edit_or_reply(event, ZelzalDV_cmd_7)


# t.me/senzir1
ZelzalDV_cmd_8 = (
    "𓆩 [𝗦𝗼𝘂𝗿𝗰𝗲 𝐑𝐄𝐅𝐙 - اوامر تحميل الصور](t.me/def_Zoka) 𓆪\n\n"
    "↫.صور + اسم الصور الي عايزو\n"
    "\n𓆩 [𐇮 𝙎𓏺𝞝𝙉𝙕𝙄𝙍 الهہـيـٖ͡ـ͢ـبـه 𐇮](t.me/senzir1) 𓆪"
)

@zedub.zed_cmd(pattern="م37")
async def cmd_37(event):
    await edit_or_reply(event, ZelzalDV_cmd_8)

# t.me/senzir1
ZelzalDV_cmd_9 = (
    "𓆩 [𝗦𝗼𝘂𝗿𝗰𝗲 𝐑𝐄𝐅𝐙 - اوامر تحميل الصور](t.me/def_Zoka) 𓆪\n\n"
    "↫.صور + اسم الصور الي عايزو\n"
    "\n𓆩 [𐇮 𝙎𓏺𝞝𝙉𝙕𝙄𝙍 الهہـيـٖ͡ـ͢ـبـه 𐇮](t.me/senzir1) 𓆪"
)

@zedub.zed_cmd(pattern="م38")
async def cmd_38(event):
    await edit_or_reply(event, ZelzalDV_cmd_9)
    
