#Copyright ©️ -Refz - Senzir


from ..core.managers import edit_or_reply
from . import zedub



# t.me/senzir1
ZelzalDV_cmd_1111 = (
    "𓆩 [𝗦𝗼𝘂𝗿𝗰𝗲 𝐑𝐄𝐅𝐙 - اوامر الزخرفه ](t.me/def_Zoka) 𓆪\n\n"
    " ⏎ اهلا بك في اوامر الزخرفه\n"
    " ⏎لاستعمال الامر ⏎ 𐇮.زخرفه + اسم الي تريدو\n"
    " تريدو لزخرفته ملحوظه عليك الاشتراك بقنوات التي ستظهر امامك \n"
    "\n𓆩 [𐇮 𝙎𓏺𝞝𝙉𝙕𝙄𝙍 الهہـيـٖ͡ـ͢ـبـه 𐇮](t.me/senzir1) 𓆪"
    "\n𓆩 [𐇮 ⧛𝐙𝐎𝐊𝐀 الهہـيـٖ͡ـ͢ـبـه 𐇮](t.me/Q_2_Q_Y) 𓆪"
)

@zedub.zed_cmd(pattern="م29")
async def cmd_29(event):
    await edit_or_reply(event, ZelzalDV_cmd_1111)
    
# t.me/senzir1
ZelzalDV_cmd = (
    "𓆩 [𝗦𝗼𝘂𝗿𝗰𝗲 𝐑𝐄𝐅𝐙 - التحديثات الجديدة ](t.me/def_Zoka) 𓆪\n\n"
    "⪼تم اضافه امر .بعصه\n"
    "⪼تم اضافه امر .شطان\n"
    "⪼تم اضافه امر .انطق\n"
    "⪼سيتم اضافه الاوامر الاخرى قريبا\n"
    "\n𓆩 [𐇮 𝙎𓏺𝞝𝙉𝙕𝙄𝙍 الهہـيـٖ͡ـ͢ـبـه 𐇮](t.me/senzir1) 𓆪"
)

@zedub.zed_cmd(pattern="م30")
async def cmd_30(event):
    await edit_or_reply(event, ZelzalDV_cmd)


# t.me/senzir1
ZelzalDV_cmd_2 = (
    "𓆩 [𝗦𝗼𝘂𝗿𝗰𝗲 𝐑𝐄𝐅𝐙 - اوامر الانتحال ](t.me/def_Zoka) 𓆪\n\n"
    "⪼ .انتحال\n"
    "⪼لاعاده حسابك كمان كان ارسل  .اعاده\n"
    "\n𓆩 [𐇮 𝙎𓏺𝞝𝙉𝙕𝙄𝙍 الهہـيـٖ͡ـ͢ـبـه 𐇮](t.me/senzir1) 𓆪"
)

@zedub.zed_cmd(pattern="م31")
async def cmd_31(event):
    await edit_or_reply(event, ZelzalDV_cmd_2)



# t.me/senzir1
ZelzalDV_cmd_3 = (
    "𓆩 [𝗦𝗼𝘂𝗿𝗰𝗲 𝐑𝐄𝐅𝐙 - اوامر التقليد ](t.me/def_Zoka) 𓆪\n\n"
    "⪼  .ازعاج\n"
    "⪼ .الغاء ازعاج\n"
    "⪼ .تقليد\n"
    "⪼ .الغاء تقليد \n"
    "⪼  .المقلدهم \n"
    "⪼  .حذف فار المقلدهم \n"
    "\n𓆩 [𐇮 𝙎𓏺𝞝𝙉𝙕𝙄𝙍 الهہـيـٖ͡ـ͢ـبـه 𐇮](t.me/senzir1) 𓆪"
)

@zedub.zed_cmd(pattern="م32")
async def cmd_32(event):
    await edit_or_reply(event, ZelzalDV_cmd_3)


# t.me/senzir1
ZelzalDV_cmd_4 = (
    "𓆩 [𝗦𝗼𝘂𝗿𝗰𝗲 𝐑𝐄𝐅𝐙 - اوامر الالعاب المتطوره ](t.me/def_Zoka) 𓆪\n\n"
    "⪼ قم بارسال .بلاي \n"
    "⪼برعاية المطور سينزر  \n" 
    "⪼ ⪼ برعاية المطور زوكا \n"
    "\n𓆩 [𐇮 𝙎𓏺𝞝𝙉𝙕𝙄𝙍 الهہـيـٖ͡ـ͢ـبـه 𐇮](t.me/senzir1) 𓆪"
)

@zedub.zed_cmd(pattern="م33")
async def cmd_33(event):
    await edit_or_reply(event, ZelzalDV_cmd_4)


# t.me/senzir1
ZelzalDV_cmd_5 = (
    "𓆩 [𝗦𝗼𝘂𝗿𝗰𝗲 𝐑𝐄𝐅𝐙 - اوامر بوت استخراج الجلسات](t.me/def_Zoka) 𓆪\n\n"
    "⪼ بوت استخراج جلسات الخاص بسورس ريفز \n"
    "⪼(@rev_m_1bot)n"
    "⪼برعاية المطور سينزر  \n" 
    "⪼ ⪼ برعاية المطور زوكا \n"
    "\n𓆩 [𐇮 𝙎𓏺𝞝𝙉𝙕𝙄𝙍 الهہـيـٖ͡ـ͢ـبـه 𐇮](t.me/senzir1) 𓆪"
)

@zedub.zed_cmd(pattern="م34")
async def cmd_34(event):
    await edit_or_reply(event, ZelzalDV_cmd_5)


# t.me/senzir1
ZelzalDV_cmd_6 = (
    "𓆩 [𝗦𝗼𝘂𝗿𝗰𝗲 𝐑𝐄𝐅𝐙 - اوامر التبليغ لتطير القنوات ](t.me/def_Zoka) 𓆪\n\n"
    " ⏎ اهلا بك في اوامر البلاغات\n"
    " ⏎لاستعمال الامر ⏎ 𐇮.بلاغ+ عدد البلاغات+ بلرد ع كود\n"
    "\n𓆩 [𐇮 𝙎𓏺𝞝𝙉𝙕𝙄𝙍 الهہـيـٖ͡ـ͢ـبـه 𐇮](t.me/senzir1) 𓆪"
    "\n𓆩 [𐇮 ⧛𝐙𝐎𝐊𝐀 الهہـيـٖ͡ـ͢ـبـه 𐇮](t.me/Q_2_Q_Y) 𓆪"
)

@zedub.zed_cmd(pattern="م35")
async def cmd_35(event):
    await edit_or_reply(event, ZelzalDV_cmd_6)

# t.me/senzir1
ZelzalDV_cmd_7 = (
    "𓆩 [𝗦𝗼𝘂𝗿𝗰𝗲 𝐑𝐄𝐅𝐙 - اوامر تحميل مسلسلات ولافلام](t.me/def_Zoka) 𓆪\n\n"
    "↫.يوت + اسم المسلسل او الفيلم او الي انت عايزو\n"
    
    "\n𓆩 [𐇮 𝙎𓏺𝞝𝙉𝙕𝙄𝙍 الهہـيـٖ͡ـ͢ـبـه 𐇮](t.me/senzir1) 𓆪"
)

@zedub.zed_cmd(pattern="م36")
async def cmd_36(event):
    await edit_or_reply(event, ZelzalDV_cmd_7)


# t.me/senzir1
ZelzalDV_cmd_8 = (
    "𓆩 [𝗦𝗼𝘂𝗿𝗰𝗲 𝐑𝐄𝐅𝐙 - اوامر تحميل الصور](t.me/def_Zoka) 𓆪\n\n"
    "↫.صور + اسم الصور الي عايزو\n"
    "\n𓆩 [𐇮 𝙎𓏺𝞝𝙉𝙕𝙄𝙍 الهہـيـٖ͡ـ͢ـبـه 𐇮](t.me/senzir1) 𓆪"
)

@zedub.zed_cmd(pattern="م37")
async def cmd_37(event):
    await edit_or_reply(event, ZelzalDV_cmd_8)

# t.me/senzir1
ZelzalDV_cmd_9 = (
    "𓆩 [𝗦𝗼𝘂𝗿𝗰𝗲 𝐑𝐄𝐅𝐙 - اوامر اخرى](t.me/def_Zoka) 𓆪\n\n"
    "↫تم اضافه امر .اكينوتر\n"
    "↫تم اضافه امر .تجربه\n"
    "↫تم اضافه امر .رساله\n"
    "↫تم اضافه امر .ساوند\n"
    "↫تم اضافه امر .سكانر\n"
    "↫تم اضافه امر .اسكرين\n"
    "↫تم اضافه امر .لوجو\n"
    "↫تم اضافه امر .لوف\n"
    "↫تم اضافه امر .لوقو\n"
    "↫تم اضافه امر .نرد\n"
    "↫تم اضافه امر .فوتوشوب\n"
    "↫تم اضافه امر .غامق\n"
    "\n𓆩 [𐇮 𝙎𓏺𝞝𝙉𝙕𝙄𝙍 الهہـيـٖ͡ـ͢ـبـه 𐇮](t.me/senzir1) 𓆪"
)

@zedub.zed_cmd(pattern="م38")
async def cmd_38(event):
    await edit_or_reply(event, ZelzalDV_cmd_9)


# t.me/senzir1
ZelzalDV_cmd_10 = (
    "𓆩 [𝗦𝗼𝘂𝗿𝗰𝗲 𝐑𝐄𝐅𝐙 - اوامر بوت دعمكم](t.me/def_Zoka) 𓆪\n\n"
     "↫لتجميع من بوت دعمكم ارسل .دعمكم\n"
     "↫لايقاف التجميع ارسل .ايقاف\n"
    "\n𓆩 [𐇮 𝙎𓏺𝞝𝙉𝙕𝙄𝙍 الهہـيـٖ͡ـ͢ـبـه 𐇮](t.me/senzir1) 𓆪"
)

@zedub.zed_cmd(pattern="م39")
async def cmd_39(event):
    await edit_or_reply(event, ZelzalDV_cmd_10)


# t.me/senzir1
ZelzalDV_cmd_11 = (
    "𓆩 [𝗦𝗼𝘂𝗿𝗰𝗲 𝐑𝐄𝐅𝐙 - اوامر الروابط](t.me/def_Zoka) 𓆪\n\n"
     "↫.اختصار\n"
     "↫.الغاء اختصار\n"
     "↫.عرض+ بلرد ع رابط\n"
     "↫.اسكرين+ الرابط\n"
     "↫.دومين+ الرابط\n"
     "↫.اخفار+ بلرد ع لرابط\n"
     
    "\n𓆩 [𐇮 𝙎𓏺𝞝𝙉𝙕𝙄𝙍 الهہـيـٖ͡ـ͢ـبـه 𐇮](t.me/senzir1) 𓆪"
    "\n𓆩 [𐇮 𝐙𝐎𝐊𝐀 الهہـيـٖ͡ـ͢ـبـه 𐇮](t.me/O_m_xl) 𓆪"
)

@zedub.zed_cmd(pattern="م40")
async def cmd_40(event):
    await edit_or_reply(event, ZelzalDV_cmd_11)


# t.me/senzir1
ZelzalDV_cmd_12 = (
    "𓆩 [𝗦𝗼𝘂𝗿𝗰𝗲 𝐑𝐄𝐅𝐙 - اوامر الذاتيه](t.me/def_Zoka) 𓆪\n\n"
    "↫.تفعيل الذاتيه\n"
    "↫.تعطيل الذاتيه\n"
    "↫.ذاتيه\n"
    "↫.مم\n"
     
    "\n𓆩 [𐇮 𝙎𓏺𝞝𝙉𝙕𝙄𝙍 الهہـيـٖ͡ـ͢ـبـه 𐇮](t.me/senzir1) 𓆪"
    "\n𓆩 [𐇮 𝐙𝐎𝐊𝐀 الهہـيـٖ͡ـ͢ـبـه 𐇮](t.me/O_m_xl) 𓆪"
)

@zedub.zed_cmd(pattern="م41")
async def cmd_41(event):
    await edit_or_reply(event, ZelzalDV_cmd_12)


# t.me/senzir1
ZelzalDV_cmd_13 = (
    "𓆩 [𝗦𝗼𝘂𝗿𝗰𝗲 𝐑𝐄𝐅𝐙 - اوامر بوت فك الحظر](t.me/def_Zoka) 𓆪\n\n"
    "↫يوزر بوت فك الحظر وتساب وتليجرام\n"
    "↫💎𝐔𝐒𝐄𝐑: @hackmek_bot\n"
    "\n𓆩 [𐇮 𝙎𓏺𝞝𝙉𝙕𝙄𝙍 الهہـيـٖ͡ـ͢ـبـه 𐇮](t.me/senzir1) 𓆪"
    "\n𓆩 [𐇮 𝐙𝐎𝐊𝐀 الهہـيـٖ͡ـ͢ـبـه 𐇮](t.me/O_m_xl) 𓆪"
)

@zedub.zed_cmd(pattern="م42")
async def cmd_42(event):
    await edit_or_reply(event, ZelzalDV_cmd_13)


# t.me/senzir1
ZelzalDV_cmd_14 = (
    "𓆩 [𝗦𝗼𝘂𝗿𝗰𝗲 𝐑𝐄𝐅𝐙 - اوامر المكالمات](t.me/def_Zoka) 𓆪\n\n"
    "↫.بدء مكالمه\n"
    "↫ .انهاء مكالمه\n"
    "↫ .انضم\n"
    "↫.خروج\n"
    "↫.دعوه + معرف/ايدي/بالـرد\n"
    "↫.عنوان + نص\n"
     "↫.معلومات المكالمه\n"
      "اوامـر الكتـم في المكالمات\n"
       "↫.اسكت  + معرف/ايدي/بالـرد\n"
       "↫ .الغاء اسكت  + معرف/ايدي/بالرد\n"
    "\n𓆩 [𐇮 𝙎𓏺𝞝𝙉𝙕𝙄𝙍 الهہـيـٖ͡ـ͢ـبـه 𐇮](t.me/IC_X_K) 𓆪"
    "\n𓆩 [𐇮 𝐙𝐎𝐊𝐀 الهہـيـٖ͡ـ͢ـبـه 𐇮](t.me/O_m_xl) 𓆪"
)

@zedub.zed_cmd(pattern="م43")
async def cmd_43(event):
    await edit_or_reply(event, ZelzalDV_cmd_14)



# t.me/senzir1
ZelzalDV_cmd_15 = (
    "𓆩 [𝗦𝗼𝘂𝗿𝗰𝗲 𝐑𝐄𝐅𝐙 - اوامر المكالمات](t.me/def_Zoka) 𓆪\n\n"
    "↫.بدء مكالمه\n"
    "↫ .انهاء مكالمه\n"
    "↫ .انضم\n"
    "↫.خروج\n"
    "↫.دعوه + معرف/ايدي/بالـرد\n"
    "↫.عنوان + نص\n"
     "↫.معلومات المكالمه\n"
      "اوامـر الكتـم في المكالمات\n"
       "↫.اسكت  + معرف/ايدي/بالـرد\n"
       "↫ .الغاء اسكت  + معرف/ايدي/بالرد\n"
    "\n𓆩 [𐇮 𝙎𓏺𝞝𝙉𝙕𝙄𝙍 الهہـيـٖ͡ـ͢ـبـه 𐇮](t.me/IC_X_K) 𓆪"
    "\n𓆩 [𐇮 𝐙𝐎𝐊𝐀 الهہـيـٖ͡ـ͢ـبـه 𐇮](t.me/O_m_xl) 𓆪"
)

@zedub.zed_cmd(pattern="م44")
async def cmd_44(event):
    await edit_or_reply(event, ZelzalDV_cmd_15)
    
