# ⓒ 2025 - REFZ Source
#كتابة وتطوير @senzir1 - @ZZF4F
# Plugin: تيم - كليشة المطورين.

from ..core.managers import edit_or_reply
from . import zedub

# كليشة المطورين
ZelzalDV_cmd = (
    "◂ كليشة مطورين تيم 𝗥𝗲𝗙𝗭™ 🇪🇬 ⤶\n\n"
    "✦─────✦❰ 𝗥𝗲𝗙𝗭™ 🇪🇬 ⤶ ❱✦─────✦\n\n"
    "𓆩 مـطـوريـن الـفـخـر 𓆪\n\n"
    "𓂅 ⌁ الاسـم : [ مـًحـمد فيجࢪ ]\n"
    "𓂅 ⌁ المعـرف : [ @O_m_xl ]\n"
    "𓂅 ⌁ الـرتبـة : ⌯ مـطـور الـسـورس\n\n"
    "𓂅 ⌁ الاسـم : [ سينزر سيــ(🗡️)ــف ]\n"
    "𓂅 ⌁ المعـرف : [ @senzir1 ]\n"
    "𓂅 ⌁ ²الـرتبـة : ⌯ مـطـور  الـسـورس\n\n"
    "𓂅 ⌁ الاسـم : [ 𝗠َِ𝗼َِ𝗗َِ𝗘َِ َِ𝗕َِ𝗮َِ𝗦َِ𝗵َِ𝗮 ]\n"
    "𓂅 ⌁ المعـرف : [ @ZZF4F ]\n"
    "𓂅 ⌁ الـرتبـة : ⌯ مـطـور ³\n\n"
    "𓂅 ⌁ الاسـم : [ 𝗛𝗔𝗥𝗕𝗜🇸🇾🦅 ]\n"
    "𓂅 ⌁ المعـرف : [ @kingsy2025 ]\n"
    "𓂅 ⌁ الـرتبـة : ⌯ مـطـور ⁴\n\n"
    "𓂅 ⌁ الاسـم : [ Rio ]\n"
    "𓂅 ⌁ المعـرف : [ @MRM_U ]\n"
    "𓂅 ⌁ الـرتبـة : ⌯ مـطـور ⁵\n\n"
    "✦─────✦❰ 𝗥𝗲𝗙𝗭™ 🇪🇬 ⤶ ❱✦─────✦\n\n"
    "𓆩 قناة السورس : https://t.me/def_Zoka 𓆪\n"
    "𓆩 رمز التيم :  ReFZ 𓆪\n"
    "𓆩 تأسيس التيم : 2021 𓆪\n"
    "𓆩 ختم 𝗥𝗲𝗙𝗭™ الرسمي 𓆪\n\n"
    "⟪ بـصـمـتـنـا بـتـتـكـلـم قـبـل مـا نـوصـل ⟫\n"
    "⟪ تِـيم الـقِـمّـة لـمَـن يَـسـتَـحِـق ⟫\n\n"
    "⌯ جـمـيـع الـحـقـوق مـحـفـوظـة لـ 𝗥𝗲𝗙𝗭™ 🇪🇬 ⤶"
)

@zedub.zed_cmd(
    pattern="التيم.",
    command=("تيم", "التيم"),
    info={
        "header": "يعرض كليشة مطورين تيم ReFZ™.",
        "الاستـخـدام": "{tr}تيم",
    },
)
async def cmd(event):
    await edit_or_reply(event, ZelzalDV_cmd)
